fio = input("ФИО исследователя: ")
date = input("Дата: ")
experiment_name = input("Название эксперимента: ")
output = input("Вывод: ")
ramka = (
    "+--------------------------------------------------+\n"
    "| Электронный лабораторный журнал                  |\n"
    "+--------------------------------------------------+\n"
    f"| ФИО исследователя : {fio} |\n"
    f"| Дата              : {date} |\n"
    f"| Эксперимент       : {experiment_name} |\n"
    "+--------------------------------------------------+\n"
    "| Вывод:                                           |\n"
    f"| {output} |\n"
    "+--------------------------------------------------+\n"
)
with open("journal.txt", "w", encoding="utf-8") as file:
    file.write(ramka)